
{
  "list": [
{
  "content":"And establish prayer and give zakah and bow with those who bow [in worship and obedience].",
  "source":"Surat Al Baqarah verse 43"
},
{
"content":"And who is more unjust than those who forbid that Allah's Name be glorified and mentioned much (i.e. prayers and invocations, etc.) in Allah's Mosques and strive for their ruin? It was not fitting that such should themselves enter them (Allah's Mosques) except in fear. For them there is disgrace in this world, and they will have a great torment in the Hereafter.",
"source":"Surat Al Baqarah verse 114"
},
{
"content":"And the mosques are for Allah (Alone), so invoke not anyone along with Allah.",
"source":"Surat Al Jinn verse 18"
},
{
"content":"In houses (mosques), which Allah has ordered to be raised (to be cleaned, and to be honoured), in them His Name is glorified in the mornings and in the afternoons or the evenings, men whom neither trade nor sale diverts them from the Remembrance of Allah (with heart and tongue), nor from performing As-Salat (Iqamat-as-Salat), nor from giving the Zakat. They fear a Day when hearts and eyes will be overturned (from the horror of the torment of the Day of Resurrection).",
"source":"Surat An Nur verses 36-37"
},
{
"content":"The Mosques of Allah shall be maintained only by those who believe in Allah and the Last Day; perform As-Salat (Iqamat-as-Salat), and give Zakat and fear none but Allah. It is they who are expected to be on true guidance.",
"source":"Surat At Taubah verse 18"
},
{
"content":"O children of Adam, take your adornment at every masjid, and eat and drink, but be not excessive. Indeed, He likes not those who commit excess.",
"source":"Surat Al A'raaf verse 31"
},
{
"content":"The Prophet (may Allah raise his rank and grant him peace) said, \"If your women ask permission to go to the mosque at night, allow them\"",
"source":"Sahih al Bukhari"
},
{
  "content":"While we were sitting with Abu Huraira in a mosque a man went out of the mosque after the call to prayer had been announced. (A man stood up in the mosque and set off.) Abu Huraira's eyes followed him till he went out of the mosque. Upon this Abu Huraira said: This man has disobeyed Abu'l- Qasim (Muhammad) (may Allah raise his rank and grant him peace)",
  "source":"Sahih Muslim"
},
{
  "content":"Allah's Messenger (may Allah raise his rank and grant him peace) said, \"The prayer in congregation is twenty seven times superior to the prayer offered by person alone\"",
  "source":"Sahih al Bukhari"
},
{
  "content":"The Messenger of Allah (may Allah raise his rank and grant him peace) said: If anyone hears a man crying out in the mosque about something he has lost, he should say: May Allah not restore it to you, for the mosques were not built for this.",
  "source":"Sahih Muslim"
},
{
  "content":"The parts of land dearest to Allah are its mosques, and the parts most hateful to Allah are markets.",
  "source":"Sahih Muslim"
},
{
  "content":"Allah's Messenger (may Allah raise his rank and grant him peace) said, \"If anyone of you enters a mosque, he should pray two rak`at before sitting.\"",
  "source":"Sahih al Bukhari"
},
{
  "content":"There is an angel on every door of the mosque recording him first who (comes) first (to the mosque for Friday prayer). And he [the Prophet (may Allah raise his rank and grant him peace)] likened him to one who offers a camel as a sacrifice and then he went on in the descending order till he reached the point at which the minimum (sacrifice) is that of an egg. And when the Imam sits (on the pulpit) the sheets are folded and they (the angels) attend to the mention of Allah.",
  "source":"Sahih Muslim"
},
{
  "content":"(The people of) Bani Salama intended to shift near the mosque (of the Prophet) but Allah's Messenger (may Allah raise his rank and grant him peace) disliked to see Medina vacated and said, \"O the people of Bani Salama! Don't you think that you will be rewarded for your footsteps which you take towards the mosque?\" So, they stayed at their old places.",
  "source":"Sahih al Bukhari"
},
{
  "content":"He who went towards the mosque in the morning or evening, Allah would arrange a feast for him morning or evening in Paradise.",
  "source":"Sahih Muslim"
}
]
}
